Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF448.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="18xxxx" edc:clonedfrom="PIC18F448" edc:desc="" edc:dosid="00195" edc:dsid="40001159" edc:informedby="DOS PS DS" edc:masksetid="" edc:name="PIC18LF448" edc:procid="0xA233" edc:psid="30009576" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:isextended="false">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power edc:hashighvoltagemclr2="true">
    <edc:VPP edc:defaultvoltage="13.000" edc:maxvoltage="13.250" edc:minvoltage="9.000"/>
    <edc:VDD edc:maxdefaultvoltage="5.500" edc:maxvoltage="5.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="5.000"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true" edc:lvpthresh="4.500" edc:memtech="ee" edc:panelsize="0x2000" edc:tries="1">
    <edc:ProgrammingWaitTime edc:progop="lverase" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="lvpgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="erase" edc:time="10000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="pgm" edc:time="1000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="cfg" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="eedata" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingWaitTime edc:progop="userid" edc:time="5000" edc:timeunits="us"/>
    <edc:ProgrammingRowSize edc:nzsize="64" edc:progop="rowerase"/>
    <edc:ProgrammingRowSize edc:nzsize="8" edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="2" edc:progop="eedata"/>
    <edc:ProgrammingRowSize edc:nzsize="8" edc:progop="userid"/>
    <edc:Wait edc:lverase="1000" edc:lvpgm="1000" edc:erase="10000" edc:pgm="1000" edc:cfg="5000" edc:eedata="5000" edc:userid="5000"/>
    <edc:Latches edc:rowerase="64" edc:pgm="8" edc:cfg="2" edc:eedata="2" edc:userid="8"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="18xxxx" edc:name="18xxxx">
    <edc:MemTraits edc:bankcount="16" edc:hwstackdepth="31">
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:UserIDMemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigFuseMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:ConfigWORMMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:DeviceIDMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0xff" edc:wordsafe="0xff" edc:wordsize="0x1"/>
      <edc:EEDataMemTraits edc:magicoffset="0xf00000"/>
      <edc:DataMemTraits edc:locsize="0x1" edc:wordimpl="0xff" edc:wordinit="0x0" edc:wordsafe="0xff" edc:wordsize="0x1"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="pic18"/>
  <edc:Oscillator>
    <edc:OscillatorMode edc:id="0" edc:max="4000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="1" edc:max="40000000" edc:min="16000000"/>
    <edc:OscillatorMode edc:id="2" edc:max="40000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="3" edc:max="40000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="4" edc:max="4000000" edc:min="32000"/>
    <edc:OscillatorMode edc:id="5" edc:max="25000000" edc:min="4000000"/>
    <edc:OscillatorMode edc:id="6" edc:max="4000000" edc:min="200000"/>
    <edc:OscillatorMode edc:id="7" edc:max="200000" edc:min="32000"/>
  </edc:Oscillator>
  <edc:Breakpoints edc:hasdatacapture="false" edc:hwbpcount="0x1" edc:idbyte="p"/>
  <edc:ProgramSpace>
    <edc:CodeSector edc:beginaddr="0x0" edc:endaddr="0x4000" edc:regionid="page"/>
    <edc:TestZone edc:beginaddr="0x200000" edc:endaddr="0x200040" edc:regionid="testmem"/>
    <edc:UserIDSector edc:beginaddr="0x200000" edc:endaddr="0x200008" edc:regionid="idlocs"/>
    <edc:ConfigFuseSector edc:beginaddr="0x300000" edc:endaddr="0x30000e" edc:regionid="config">
      <edc:AdjustPoint edc:offset="1" edc:_addr="0x300000"/>
      <edc:DCRDef edc:access="--n--nnn" edc:cname="CONFIG1H" edc:desc="" edc:factorydefault="0x27" edc:impl="0x27" edc:name="CONFIG1H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x27" edc:default="0x27" edc:_addr="0x300001">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="OSC" edc:desc="Oscillator Selection bits" edc:mask="0x7" edc:name="OSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="RCIO" edc:desc="RC oscillator w/ OSC2 configured as RA6" edc:oscmodeidref="0" edc:when="(field &amp; 0x7) == 0x7">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_RCIO_OSC"/>
                  <edc:LegacyAlias edc:cname="_RCIO_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HSPLL" edc:desc="HS oscillator with PLL enabled/Clock frequency = (4 x FOSC)" edc:oscmodeidref="1" edc:when="(field &amp; 0x7) == 0x6">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_HSPLL_OSC"/>
                  <edc:LegacyAlias edc:cname="_HSPLL_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ECIO" edc:desc="EC oscillator w/ OSC2 configured as RA6" edc:oscmodeidref="2" edc:when="(field &amp; 0x7) == 0x5">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_ECIO_OSC"/>
                  <edc:LegacyAlias edc:cname="_ECIO_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator w/ OSC2 configured as divide-by-4 clock output" edc:oscmodeidref="3" edc:when="(field &amp; 0x7) == 0x4">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_EC_OSC"/>
                  <edc:LegacyAlias edc:cname="_EC_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="RC" edc:desc="RC oscillator" edc:oscmodeidref="4" edc:when="(field &amp; 0x7) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_RC_OSC"/>
                  <edc:LegacyAlias edc:cname="_RC_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator" edc:oscmodeidref="5" edc:when="(field &amp; 0x7) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_HS_OSC"/>
                  <edc:LegacyAlias edc:cname="_HS_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator" edc:oscmodeidref="6" edc:when="(field &amp; 0x7) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_XT_OSC"/>
                  <edc:LegacyAlias edc:cname="_XT_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="LP" edc:desc="LP oscillator" edc:oscmodeidref="7" edc:when="(field &amp; 0x7) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_LP_OSC"/>
                  <edc:LegacyAlias edc:cname="_LP_OSC_1H"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="OSCS" edc:desc="Oscillator System Clock Switch Enable bit" edc:mask="0x1" edc:name="OSCS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Oscillator system clock switch option is disabled (main oscillator is source)" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Oscillator system clock switch option is enabled (oscillator switching is enabled)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG2L" edc:desc="" edc:factorydefault="0xf" edc:impl="0xf" edc:name="CONFIG2L" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf" edc:default="0xf" edc:_addr="0x300002">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="PWRT" edc:desc="Power-up Timer Enable bit" edc:mask="0x1" edc:name="PWRT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="PWRT disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="PWRT enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOR" edc:desc="Brown-out Reset Enable bit" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Brown-out Reset enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Brown-out Reset disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BORV" edc:desc="Brown-out Reset Voltage bits" edc:mask="0x3" edc:name="BORV" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="25" edc:desc="VBOR set to 2.5V" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="_BORV_25"/>
                  <edc:LegacyAlias edc:cname="_BORV_25_2L"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="27" edc:desc="VBOR set to 2.7V" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="42" edc:desc="VBOR set to 4.2V" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="45" edc:desc="VBOR set to 4.5V" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="----nnnn" edc:cname="CONFIG2H" edc:desc="" edc:factorydefault="0xf" edc:impl="0xf" edc:name="CONFIG2H" edc:nzwidth="0x8" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf" edc:default="0xf" edc:_addr="0x300003">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WDT" edc:desc="Watchdog Timer Enable bit" edc:mask="0x1" edc:name="WDT" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="WDT enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="WDT disabled (control is placed on the SWDTEN bit)" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDTPS" edc:desc="Watchdog Timer Postscale Select bits" edc:mask="0x7" edc:name="WDTPS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="128" edc:desc="1:128" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="64" edc:desc="1:64" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="32" edc:desc="1:32" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="16" edc:desc="1:16" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="8" edc:desc="1:8" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="4" edc:desc="1:4" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="2" edc:desc="1:2" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="1" edc:desc="1:1" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
