Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF448.PIC
        <edc:SFRDef edc:access="rrr-rrr-" edc:cname="CANSTATRO3" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-uuu-" edc:name="CANSTATRO3" edc:nzwidth="0x8" edc:por="xxx-xxx-" edc:_addr="0xF3E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0xF3F"/>
        <edc:SFRDef edc:access="-rrrn-nn" edc:cname="TXB0CON" edc:desc="" edc:impl="0x7b" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000-00" edc:name="TXB0CON" edc:nzwidth="0x8" edc:por="-0000-00" edc:_addr="0xF40">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXPRI0" edc:desc="" edc:mask="0x1" edc:name="TXPRI0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXPRI1" edc:desc="" edc:mask="0x1" edc:name="TXPRI1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="TXREQ" edc:desc="" edc:mask="0x1" edc:name="TXREQ" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXERR" edc:desc="" edc:mask="0x1" edc:name="TXERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXLARB" edc:desc="" edc:mask="0x1" edc:name="TXLARB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXABT" edc:desc="" edc:mask="0x1" edc:name="TXABT" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0PRI0" edc:desc="" edc:mask="0x1" edc:name="TXB0PRI0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0PRI1" edc:desc="" edc:mask="0x1" edc:name="TXB0PRI1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0REQ" edc:desc="" edc:mask="0x1" edc:name="TXB0REQ" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0ERR" edc:desc="" edc:mask="0x1" edc:name="TXB0ERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0LARB" edc:desc="" edc:mask="0x1" edc:name="TXB0LARB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0ABT" edc:desc="" edc:mask="0x1" edc:name="TXB0ABT" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF41">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0SID3" edc:desc="" edc:mask="0x1" edc:name="TXB0SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID4" edc:desc="" edc:mask="0x1" edc:name="TXB0SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID5" edc:desc="" edc:mask="0x1" edc:name="TXB0SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID6" edc:desc="" edc:mask="0x1" edc:name="TXB0SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID7" edc:desc="" edc:mask="0x1" edc:name="TXB0SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID8" edc:desc="" edc:mask="0x1" edc:name="TXB0SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID9" edc:desc="" edc:mask="0x1" edc:name="TXB0SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID10" edc:desc="" edc:mask="0x1" edc:name="TXB0SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0SIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="TXB0SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xF42">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0EID16" edc:desc="" edc:mask="0x1" edc:name="TXB0EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID17" edc:desc="" edc:mask="0x1" edc:name="TXB0EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0EXIDE" edc:desc="" edc:mask="0x1" edc:name="TXB0EXIDE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID0" edc:desc="" edc:mask="0x1" edc:name="TXB0SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID1" edc:desc="" edc:mask="0x1" edc:name="TXB0SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0SID2" edc:desc="" edc:mask="0x1" edc:name="TXB0SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF43">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0EID8" edc:desc="" edc:mask="0x1" edc:name="TXB0EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID9" edc:desc="" edc:mask="0x1" edc:name="TXB0EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID10" edc:desc="" edc:mask="0x1" edc:name="TXB0EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID11" edc:desc="" edc:mask="0x1" edc:name="TXB0EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID12" edc:desc="" edc:mask="0x1" edc:name="TXB0EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID13" edc:desc="" edc:mask="0x1" edc:name="TXB0EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID14" edc:desc="" edc:mask="0x1" edc:name="TXB0EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID15" edc:desc="" edc:mask="0x1" edc:name="TXB0EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF44">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0EID0" edc:desc="" edc:mask="0x1" edc:name="TXB0EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID1" edc:desc="" edc:mask="0x1" edc:name="TXB0EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID2" edc:desc="" edc:mask="0x1" edc:name="TXB0EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID3" edc:desc="" edc:mask="0x1" edc:name="TXB0EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID4" edc:desc="" edc:mask="0x1" edc:name="TXB0EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID5" edc:desc="" edc:mask="0x1" edc:name="TXB0EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID6" edc:desc="" edc:mask="0x1" edc:name="TXB0EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0EID7" edc:desc="" edc:mask="0x1" edc:name="TXB0EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n--nnnn" edc:cname="TXB0DLC" edc:desc="" edc:impl="0x4f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-u--uuuu" edc:name="TXB0DLC" edc:nzwidth="0x8" edc:por="-x--xxxx" edc:_addr="0xF45">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="TXB0DLC0" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0DLC1" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0DLC2" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXB0DLC3" edc:desc="" edc:mask="0x1" edc:name="TXB0DLC3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXB0RTR" edc:desc="" edc:mask="0x1" edc:name="TXB0RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF46">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D00" edc:desc="" edc:mask="0x1" edc:name="TXB0D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D01" edc:desc="" edc:mask="0x1" edc:name="TXB0D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D02" edc:desc="" edc:mask="0x1" edc:name="TXB0D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D03" edc:desc="" edc:mask="0x1" edc:name="TXB0D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D04" edc:desc="" edc:mask="0x1" edc:name="TXB0D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D05" edc:desc="" edc:mask="0x1" edc:name="TXB0D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D06" edc:desc="" edc:mask="0x1" edc:name="TXB0D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D07" edc:desc="" edc:mask="0x1" edc:name="TXB0D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TXB0D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TXB0D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF47">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXB0D10" edc:desc="" edc:mask="0x1" edc:name="TXB0D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D11" edc:desc="" edc:mask="0x1" edc:name="TXB0D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D12" edc:desc="" edc:mask="0x1" edc:name="TXB0D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D13" edc:desc="" edc:mask="0x1" edc:name="TXB0D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D14" edc:desc="" edc:mask="0x1" edc:name="TXB0D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D15" edc:desc="" edc:mask="0x1" edc:name="TXB0D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D16" edc:desc="" edc:mask="0x1" edc:name="TXB0D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0D17" edc:desc="" edc:mask="0x1" edc:name="TXB0D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
