Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF448.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D40" edc:desc="" edc:mask="0x1" edc:name="RXB1D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D41" edc:desc="" edc:mask="0x1" edc:name="RXB1D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D42" edc:desc="" edc:mask="0x1" edc:name="RXB1D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D43" edc:desc="" edc:mask="0x1" edc:name="RXB1D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D44" edc:desc="" edc:mask="0x1" edc:name="RXB1D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D45" edc:desc="" edc:mask="0x1" edc:name="RXB1D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D46" edc:desc="" edc:mask="0x1" edc:name="RXB1D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D47" edc:desc="" edc:mask="0x1" edc:name="RXB1D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D50" edc:desc="" edc:mask="0x1" edc:name="RXB1D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D51" edc:desc="" edc:mask="0x1" edc:name="RXB1D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D52" edc:desc="" edc:mask="0x1" edc:name="RXB1D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D53" edc:desc="" edc:mask="0x1" edc:name="RXB1D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D54" edc:desc="" edc:mask="0x1" edc:name="RXB1D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D55" edc:desc="" edc:mask="0x1" edc:name="RXB1D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D56" edc:desc="" edc:mask="0x1" edc:name="RXB1D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D57" edc:desc="" edc:mask="0x1" edc:name="RXB1D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D60" edc:desc="" edc:mask="0x1" edc:name="RXB1D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D61" edc:desc="" edc:mask="0x1" edc:name="RXB1D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D62" edc:desc="" edc:mask="0x1" edc:name="RXB1D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D63" edc:desc="" edc:mask="0x1" edc:name="RXB1D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D64" edc:desc="" edc:mask="0x1" edc:name="RXB1D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D65" edc:desc="" edc:mask="0x1" edc:name="RXB1D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D66" edc:desc="" edc:mask="0x1" edc:name="RXB1D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D67" edc:desc="" edc:mask="0x1" edc:name="RXB1D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB1D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF5D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D70" edc:desc="" edc:mask="0x1" edc:name="RXB1D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D71" edc:desc="" edc:mask="0x1" edc:name="RXB1D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D72" edc:desc="" edc:mask="0x1" edc:name="RXB1D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D73" edc:desc="" edc:mask="0x1" edc:name="RXB1D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D74" edc:desc="" edc:mask="0x1" edc:name="RXB1D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D75" edc:desc="" edc:mask="0x1" edc:name="RXB1D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D76" edc:desc="" edc:mask="0x1" edc:name="RXB1D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D77" edc:desc="" edc:mask="0x1" edc:name="RXB1D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrr-rrr-" edc:cname="CANSTATRO1" edc:desc="" edc:impl="0xee" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx-xxx-" edc:name="CANSTATRO1" edc:nzwidth="0x8" edc:por="xxx-xxx-" edc:_addr="0xF5E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0xf" edc:beginaddr="0xf60" edc:endaddr="0x1000" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="cnn-rnrn" edc:cname="RXB0CON" edc:desc="" edc:impl="0xef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-0000" edc:name="RXB0CON" edc:nzwidth="0x8" edc:por="000-0000" edc:_addr="0xF60">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FILHIT0" edc:desc="" edc:mask="0x1" edc:name="FILHIT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="JTOFF" edc:desc="" edc:mask="0x1" edc:name="JTOFF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0DBEN" edc:desc="" edc:mask="0x1" edc:name="RXB0DBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTRRO" edc:desc="" edc:mask="0x1" edc:name="RXRTRRO" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXM0" edc:desc="" edc:mask="0x1" edc:name="RXM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXM1" edc:desc="" edc:mask="0x1" edc:name="RXM1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXFUL" edc:desc="" edc:mask="0x1" edc:name="RXFUL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0FILHIT0" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT1" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT2" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FILHIT3" edc:desc="" edc:mask="0x1" edc:name="RXB0FILHIT3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0M0" edc:desc="" edc:mask="0x1" edc:name="RXB0M0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0M1" edc:desc="" edc:mask="0x1" edc:name="RXB0M1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0FUL" edc:desc="" edc:mask="0x1" edc:name="RXB0FUL" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RXB0RTRR0" edc:desc="" edc:mask="0x1" edc:name="RXB0RTRR0" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0RTRRO" edc:desc="" edc:mask="0x1" edc:name="RXB0RTRRO" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF61">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0SID3" edc:desc="" edc:mask="0x1" edc:name="RXB0SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID4" edc:desc="" edc:mask="0x1" edc:name="RXB0SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID5" edc:desc="" edc:mask="0x1" edc:name="RXB0SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID6" edc:desc="" edc:mask="0x1" edc:name="RXB0SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID7" edc:desc="" edc:mask="0x1" edc:name="RXB0SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID8" edc:desc="" edc:mask="0x1" edc:name="RXB0SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID9" edc:desc="" edc:mask="0x1" edc:name="RXB0SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID10" edc:desc="" edc:mask="0x1" edc:name="RXB0SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="RXB0SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0SIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF62">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0EID16" edc:desc="" edc:mask="0x1" edc:name="RXB0EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID17" edc:desc="" edc:mask="0x1" edc:name="RXB0EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0EXID" edc:desc="" edc:mask="0x1" edc:name="RXB0EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SRR" edc:desc="" edc:mask="0x1" edc:name="RXB0SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID0" edc:desc="" edc:mask="0x1" edc:name="RXB0SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID1" edc:desc="" edc:mask="0x1" edc:name="RXB0SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0SID2" edc:desc="" edc:mask="0x1" edc:name="RXB0SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXB0EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB0EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB0EID8" edc:desc="" edc:mask="0x1" edc:name="RXB0EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID9" edc:desc="" edc:mask="0x1" edc:name="RXB0EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID10" edc:desc="" edc:mask="0x1" edc:name="RXB0EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID11" edc:desc="" edc:mask="0x1" edc:name="RXB0EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID12" edc:desc="" edc:mask="0x1" edc:name="RXB0EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID13" edc:desc="" edc:mask="0x1" edc:name="RXB0EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID14" edc:desc="" edc:mask="0x1" edc:name="RXB0EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB0EID15" edc:desc="" edc:mask="0x1" edc:name="RXB0EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
